<!-- add-pr-comment:add-pr-comment -->

Terraform Plan **Production**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.myec2vm[0] will be updated in-place
  ~ resource "aws_instance" "myec2vm" {
        id                                   = "i-0b8b09e951fcee44d"
      ~ instance_type                        = "t3.micro" -> "t3.small"
      ~ tags                                 = {
            "Environment" = "GithubActionsWorkflow"
          ~ "Name"        = "CI/CD_staging8_0" -> "CI/CD_staging_9_0"
            "Service"     = "CICD"
        }
      ~ tags_all                             = {
          ~ "Name"        = "CI/CD_staging8_0" -> "CI/CD_staging_9_0"
            # (2 unchanged elements hidden)
        }
        # (31 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.myec2vm[1] will be created
+   resource "aws_instance" "myec2vm" {
+       ami                                  = "ami-0c9e929defa073d7d"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3.small"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = "terraform-key"
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Environment" = "GithubActionsWorkflow"
+           "Name"        = "CI/CD_staging_9_1"
+           "Service"     = "CICD"
        }
+       tags_all                             = {
+           "Environment" = "GithubActionsWorkflow"
+           "Name"        = "CI/CD_staging_9_1"
+           "Service"     = "CICD"
        }
+       tenancy                              = (known after apply)
+       user_data                            = "115d9a6ff7166c0c84f76b87379953bfd452c8e9"
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = [
+           "sg-0de0f8502e84f30d8",
+           "sg-0decb013fa63be1e1",
        ]
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.myec2vm[0] will be updated in-place
  ~ resource "aws_instance" "myec2vm" {
        id                                   = "i-0b8b09e951fcee44d"
      ~ instance_type                        = "t3.micro" -> "t3.small"
      ~ tags                                 = {
            "Environment" = "GithubActionsWorkflow"
          ~ "Name"        = "CI/CD_staging8_0" -> "CI/CD_staging_9_0"
            "Service"     = "CICD"
        }
      ~ tags_all                             = {
          ~ "Name"        = "CI/CD_staging8_0" -> "CI/CD_staging_9_0"
            # (2 unchanged elements hidden)
        }
        # (31 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.myec2vm[1] will be created
  + resource "aws_instance" "myec2vm" {
      + ami                                  = "ami-0c9e929defa073d7d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "GithubActionsWorkflow"
          + "Name"        = "CI/CD_staging_9_1"
          + "Service"     = "CICD"
        }
      + tags_all                             = {
          + "Environment" = "GithubActionsWorkflow"
          + "Name"        = "CI/CD_staging_9_1"
          + "Service"     = "CICD"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "115d9a6ff7166c0c84f76b87379953bfd452c8e9"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0de0f8502e84f30d8",
          + "sg-0decb013fa63be1e1",
        ]
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```